/*
Задача 3.Необязательная, дополнительная задача Задайте двумерный массив из трехзначных целых чисел 
(не менее 100 элементов). 
В каждом столбце найдите среднее арифметическое среди тех элементов,
которые являются палиндромами (если палиндромов нет, то среднее арифметическое считать равным 0). 
Полученные средние арифметические занести в одномерный массив.

Например, задан массив:
100 404 504 225
550 478 800 363
505 101 410 479

=> [505, 252.5, 0, 363 ]
*/

internal class Program
{
    private static void Main(string[] args)
    {
        Console.WriteLine("Hello, World!");
    }
}